123,10,32,32,34,98,111,115,95,116,111,107,101,110,34,58,32,34,60,115,62,34,44,10,32,32,34,99,108,115,95,116,111,107,101,110,34,58,32,34,60,115,62,34,44,10,32,32,34,101,111,115,95,116,111,107,101,110,34,58,32,34,60,47,115,62,34,44,10,32,32,34,109,97,115,107,95,116,111,107,101,110,34,58,32,123,10,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,109,97,115,107,62,34,44,10,32,32,32,32,34,108,115,116,114,105,112,34,58,32,116,114,117,101,44,10,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,10,32,32,125,44,10,32,32,34,112,97,100,95,116,111,107,101,110,34,58,32,34,60,112,97,100,62,34,44,10,32,32,34,115,101,112,95,116,111,107,101,110,34,58,32,34,60,47,115,62,34,44,10,32,32,34,117,110,107,95,116,111,107,101,110,34,58,32,34,60,117,110,107,62,34,10,125,10