123,10,32,32,34,97,100,100,95,112,114,101,102,105,120,95,115,112,97,99,101,34,58,32,102,97,108,115,101,44,10,32,32,34,97,100,100,101,100,95,116,111,107,101,110,115,95,100,101,99,111,100,101,114,34,58,32,123,10,32,32,32,32,34,48,34,58,32,123,10,32,32,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,115,62,34,44,10,32,32,32,32,32,32,34,108,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,112,101,99,105,97,108,34,58,32,116,114,117,101,10,32,32,32,32,125,44,10,32,32,32,32,34,49,34,58,32,123,10,32,32,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,112,97,100,62,34,44,10,32,32,32,32,32,32,34,108,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,112,101,99,105,97,108,34,58,32,116,114,117,101,10,32,32,32,32,125,44,10,32,32,32,32,34,50,34,58,32,123,10,32,32,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,47,115,62,34,44,10,32,32,32,32,32,32,34,108,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,112,101,99,105,97,108,34,58,32,116,114,117,101,10,32,32,32,32,125,44,10,32,32,32,32,34,51,34,58,32,123,10,32,32,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,117,110,107,62,34,44,10,32,32,32,32,32,32,34,108,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,112,101,99,105,97,108,34,58,32,116,114,117,101,10,32,32,32,32,125,44,10,32,32,32,32,34,53,48,50,54,52,34,58,32,123,10,32,32,32,32,32,32,34,99,111,110,116,101,110,116,34,58,32,34,60,109,97,115,107,62,34,44,10,32,32,32,32,32,32,34,108,115,116,114,105,112,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,110,111,114,109,97,108,105,122,101,100,34,58,32,116,114,117,101,44,10,32,32,32,32,32,32,34,114,115,116,114,105,112,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,105,110,103,108,101,95,119,111,114,100,34,58,32,102,97,108,115,101,44,10,32,32,32,32,32,32,34,115,112,101,99,105,97,108,34,58,32,116,114,117,101,10,32,32,32,32,125,10,32,32,125,44,10,32,32,34,98,111,115,95,116,111,107,101,110,34,58,32,34,60,115,62,34,44,10,32,32,34,99,108,101,97,110,95,117,112,95,116,111,107,101,110,105,122,97,116,105,111,110,95,115,112,97,99,101,115,34,58,32,116,114,117,101,44,10,32,32,34,99,108,115,95,116,111,107,101,110,34,58,32,34,60,115,62,34,44,10,32,32,34,101,111,115,95,116,111,107,101,110,34,58,32,34,60,47,115,62,34,44,10,32,32,34,101,114,114,111,114,115,34,58,32,34,114,101,112,108,97,99,101,34,44,10,32,32,34,109,97,115,107,95,116,111,107,101,110,34,58,32,34,60,109,97,115,107,62,34,44,10,32,32,34,109,111,100,101,108,95,109,97,120,95,108,101,110,103,116,104,34,58,32,49,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,48,49,57,56,56,52,54,50,52,56,51,56,54,53,54,44,10,32,32,34,112,97,100,95,116,111,107,101,110,34,58,32,34,60,112,97,100,62,34,44,10,32,32,34,115,101,112,95,116,111,107,101,110,34,58,32,34,60,47,115,62,34,44,10,32,32,34,116,111,107,101,110,105,122,101,114,95,99,108,97,115,115,34,58,32,34,66,97,114,116,84,111,107,101,110,105,122,101,114,34,44,10,32,32,34,116,114,105,109,95,111,102,102,115,101,116,115,34,58,32,116,114,117,101,44,10,32,32,34,117,110,107,95,116,111,107,101,110,34,58,32,34,60,117,110,107,62,34,10,125,10